package main

// Prefecture names indexed by JIS code - 1.
var prefNames = [47]string{
	"北海道", "青森県", "岩手県", "宮城県", "秋田県", "山形県", "福島県",
	"茨城県", "栃木県", "群馬県", "埼玉県", "千葉県", "東京都", "神奈川県",
	"新潟県", "富山県", "石川県", "福井県", "山梨県", "長野県", "岐阜県",
	"静岡県", "愛知県", "三重県", "滋賀県", "京都府", "大阪府", "兵庫県",
	"奈良県", "和歌山県", "鳥取県", "島根県", "岡山県", "広島県", "山口県",
	"徳島県", "香川県", "愛媛県", "高知県", "福岡県", "佐賀県", "長崎県",
	"熊本県", "大分県", "宮崎県", "鹿児島県", "沖縄県",
}

var prefNamesKo = [47]string{
	"홋카이도", "아오모리현", "이와테현", "미야기현", "아키타현", "야마가타현", "후쿠시마현",
	"이바라키현", "도치기현", "군마현", "사이타마현", "지바현", "도쿄도", "가나가와현",
	"니가타현", "도야마현", "이시카와현", "후쿠이현", "야마나시현", "나가노현", "기후현",
	"시즈오카현", "아이치현", "미에현", "시가현", "교토부", "오사카부", "효고현",
	"나라현", "와카야마현", "돗토리현", "시마네현", "오카야마현", "히로시마현", "야마구치현",
	"도쿠시마현", "가가와현", "에히메현", "고치현", "후쿠오카현", "사가현", "나가사키현",
	"구마모토현", "오이타현", "미야자키현", "가고시마현", "오키나와현",
}
